

def simpson(func, a, b, eps)-> tuple[float, float, int]:
    """

    :param func: функция
    :param a: нижний предел интегрирования
    :param b: верхний предел интегрирования
    :param eps: требуемая точность
    :return: (value, error_estimate, n)

    value — приближённое значение интеграла,
    error_estimate — оценку погрешности этого значения,
    n — число разбиений (или итераций), которое потребовалось для достижения точности
    """

    number_segments = 20 # чётное количество равных отрезков для разбиения [a, b]

    